linkedin-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/linkedin/getNetworkUpdates.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.linkedin.getnetworkupdates">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:appUri>https://api.linkedin.com/v1</urn:appUri>
      <urn:accessToken>AQWkBcZLSfWzgsSs_sUd-5qGW7O2DzbQv4tL7F6s8i8Sl5xCiLE5WCIkbAfd6voe62PJGJyTT9doPmUWsT3S9mXJ1KgiLO0O44aT3VxH-hC7LKd4_zRdN-MNvAIiewp-Gg_Jfms3yHejAVNJt1tjZlbgzTpHeKegOWQRWVj0qcPHSufIIQg</urn:accessToken>
      
   </soapenv:Body>
</soapenv:Envelope>
